const hamburger = document.querySelector(".hamburger");
const navMenu = document.querySelector(".nav-menu");

hamburger.addEventListener("click", ()=>{
  hamburger.classList.toggle("active");
  navMenu.classList.toggle("active");
})

document.querySelectorAll(".nav-link").forEach(n => n.addEventListener("click",() => {
  hamburger.classList.remove("active")
  navMenu.classList.remove("active")
}))



function performTranslation() {
    var armenianInput = document.getElementById("armenianInput").value.toLowerCase();
    var artsakhInput = document.getElementById("artsakhInput");

    // JavaScript code for transliteration
    var armenianToLatin = {
       'ոնցես': 'հունցս', 'լույս': 'լուս',
      'բարև': 'բարև', 'ոնցես': 'հունցս', 'լույս': 'լուս',
      'բարև': 'պարիօր', 'ողջույն': 'պարիօր', 'բարի առավոտ': 'Պար լուս',
      'բարի օր': 'պարիօր', 'բարի երեկո': 'պարի գշեր', 'ինչպես ես': 'հունցս՞',
      'լավ': 'լյավ', 'վատ չէ': 'պիս չի', 'այո': 'հա', 'ոչ': 'չէ',
      'միգուցե': 'բալի', 'խնդրում եմ': 'խնդրում', 'շնորհակալություն': 'սպասիբա',
      'ներեցեք': 'ներղություն', 'իհարկե': 'պա հինչ', 'բացարձակապես': 'վոշմին եկրպ',
      'եւ': 'ու', 'ինչու': 'խե', 'ինչ': 'հինչ', 'երբ': 'հիբ', 'որտեղ': 'շտեղ',
      'որ': 'վեր', 'ինչպես': 'հունց', 'արեք': 'ըրեք', 'արեց': 'ըրավ', 'կարող է': 'կարե',
      'կարող էր': 'կրար', 'պետք է': 'պետքա', 'կկամենա': 'կոզի', 'կարող է': 'կկար',
      'անհրաժեշտություն': 'պարտադիր', 'ունենալ': 'ոնիմ', 'ունի': 'ոնե', 'եղել է': 'իլալա',
      'եղել են': 'իլալն', 'լինելով': 'ինիլավ', 'եղել է': 'իլալա', 'դուք': 'տուք',
      'այն': 'են', 'մենք': 'մունք', 'նրանք': 'ուրանք', 'դուք': 'տուք', 'նրան': 'ուրան',
      'նրա': 'ուրան', 'մեզ': 'մզ', 'նրանց': 'ուրանք', 'իմ': 'իմ', 'ձեր': 'ծեր', 'նրան': 'ուրան',
      'նրա': 'ուրան', 'դրան': 'դրան', 'իրենց': 'ուրանց', 'դա': 'տա', 'սրանք': 'սրանք',
      'նրանք': 'ուրանք', 'այնտեղ': 'դղ', 'այստեղ': 'ստղ','հիմա': 'մեհենգ', 'շուտով': 'էսա', 'ավելի ուշ': 'ավելի ետե',
      'կրկին': 'նորից', 'այսօր': 'սօր', 'վաղը': 'եքուծ', 'երեկ': 'յիրկե', 'այնուամենայնիվ': 'մինա','ավել': 'ավիլ', 'ապա': 'ու', 'հաջորդը': 'էմինը', 'հաջորդ': 'էմին',
      'առաջին': 'պերվի', 'երկրորդ': 'վտարոյ', 'բացի այդ': 'բացի տրանից', 'եզրափակելով': 'պրծնելավ',
      'համառոտ': 'կարճ', 'այլ կերպ ասած': 'որիշ ձև ասած', 'տվյալ դեպքում': 'էս դեպքում', 'երբ': 'հիբ',
      'Նախկինում': 'առաջ', 'ինչպես': 'հունց', 'ասես': 'ասիս', 'ինչպես': 'հունց', 'ճիշտ ասած': 'դուզն ասած',
      'իսկապես': 'իրոք', 'ակնհայտ է': 'աչեվիդնիա', 'ուստի': 'տրա հտե', 'հաջորդը': 'էմինը', 'բացի այդ': 'բացի տրանից',
      'արդյունքում': 'ի տոգի', 'երբ': 'հիբ', 'Նախկինում': 'առաջ', 'ընթացքում': 'դաղումը', 'ասես': 'ասիս',
      'հավանել': 'տուր կյալ', 'պարզ է': 'պարզա', 'այդ ընթացքում': 'ետ ընթացքում', 'հետագայում': 'հետո',
      'էսա': 'էսա', 'Նախկինում': 'առաջ', 'Վերջերս': 'էս օրերին', 'Ներկայումս': 'մեհենգ', 'Երբեմն': 'ղաթումը',
      'Հաճախակի': 'շուշուտ', 'Սովորաբար': 'հիմնականում', 'Հաճախ': 'շուշուտ', 'Հազվադեպ': 'ղաթումը',
      'Մի անգամ': 'մեհետե', 'համար': 'հտե', 'երեկվա': 'յիրկվա'
  };
  

    var result = '';
    armenianInput.split(' ').forEach(function(word) {
        result += armenianToLatin[word] || word;
        result += ' ';
    });

    artsakhInput.value = result.trim();
}
